---
kind: other
id: Properties.T:Autodesk.Revit.DB.ImportOptions3DM
source: html/54ebae55-c8c1-4ad8-dc04-d4084b1a2071.htm
---
# ImportOptions3DM Properties

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.